<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,3,320,320" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/model.23/Constant_9_output_0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 2100" offset="0" size="16800" />
			<output>
				<port id="0" precision="FP32" names="/model.23/Constant_9_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2100</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="16800" size="1728" />
			<output>
				<port id="0" precision="FP32" names="model.0.conv.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/model.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_209" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="18528" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/model.0/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/model.0/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model.1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 3, 3" offset="18592" size="18432" />
			<output>
				<port id="0" precision="FP32" names="model.1.conv.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/model.1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_224" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="37024" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/model.1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/model.1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="37152" size="4096" />
			<output>
				<port id="0" precision="FP32" names="model.2.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/model.2/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_239" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="41248" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/model.2/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/model.2/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_243" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="41376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="onnx::Split_185" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="41384" size="16" />
			<output>
				<port id="0" precision="I64" names="onnx::Split_185">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/model.2/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.2/Split_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="4" precision="FP32" names="/model.2/Split_output_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model.2.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 16, 3, 3" offset="41400" size="4608" />
			<output>
				<port id="0" precision="FP32" names="model.2.m.0.cv1.conv.weight">
					<dim>8</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/model.2/m.0/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_256" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="46008" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/model.2/m.0/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/model.2/m.0/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/m.0/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model.2.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 3, 3" offset="46040" size="4608" />
			<output>
				<port id="0" precision="FP32" names="model.2.m.0.cv2.conv.weight">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/model.2/m.0/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_271" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="50648" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model.2/m.0/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/model.2/m.0/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/m.0/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/model.2/m.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model.2/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.2/Concat_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 48, 1, 1" offset="50712" size="12288" />
			<output>
				<port id="0" precision="FP32" names="model.2.cv2.conv.weight">
					<dim>64</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/model.2/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_288" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="63000" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model.2/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/model.2/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model.3.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="63256" size="147456" />
			<output>
				<port id="0" precision="FP32" names="model.3.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/model.3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_303" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="210712" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/model.3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.3/conv/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model.3/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.3/act/Mul_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model.4.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="210968" size="16384" />
			<output>
				<port id="0" precision="FP32" names="model.4.cv1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/model.4/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_318" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="227352" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/model.4/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.4/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/model.4/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.4/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_322" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="41376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="48" name="onnx::Split_205" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="227608" size="16" />
			<output>
				<port id="0" precision="I64" names="onnx::Split_205">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/model.4/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.4/Split_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP32" names="/model.4/Split_output_1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="model.4.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 3, 3" offset="227624" size="18432" />
			<output>
				<port id="0" precision="FP32" names="model.4.m.0.cv1.conv.weight">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/model.4/m.0/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_335" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="246056" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model.4/m.0/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.4/m.0/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/model.4/m.0/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.4/m.0/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model.4.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 3, 3" offset="246120" size="18432" />
			<output>
				<port id="0" precision="FP32" names="model.4.m.0.cv2.conv.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model.4/m.0/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_350" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="264552" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/model.4/m.0/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.4/m.0/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/model.4/m.0/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.4/m.0/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model.4/m.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.4/m.0/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/model.4/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.4/Concat_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model.4.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 96, 1, 1" offset="264680" size="49152" />
			<output>
				<port id="0" precision="FP32" names="model.4.cv2.conv.weight">
					<dim>128</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model.4/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_367" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="313832" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/model.4/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.4/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model.4/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.4/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model.5.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="314344" size="589824" />
			<output>
				<port id="0" precision="FP32" names="model.5.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/model.5/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_382" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="904168" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/model.5/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.5/conv/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model.5/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.5/act/Mul_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model.6.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1, 1" offset="904680" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model.6.cv1.conv.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/model.6/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_397" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="970216" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/model.6/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model.6/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.6/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_401" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="41376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="78" name="onnx::Split_225" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="970728" size="16" />
			<output>
				<port id="0" precision="I64" names="onnx::Split_225">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model.6/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.6/Split_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="4" precision="FP32" names="/model.6/Split_output_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model.6.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 64, 1, 1" offset="970744" size="8192" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.0.cv1.conv.weight">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/model.6/m.0/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_414" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="978936" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/model.6/m.0/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/m.0/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model.6/m.0/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.6/m.0/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model.6.m.0.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="979064" size="36864" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.0.m.0.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/model.6/m.0/m/m.0/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_444" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1015928" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model.6/m.0/m/m.0/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/m.0/m/m.0/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/model.6/m.0/m/m.0/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.6/m.0/m/m.0/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model.6.m.0.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="1016056" size="36864" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.0.m.0.cv2.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/model.6/m.0/m/m.0/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_459" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1052920" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model.6/m.0/m/m.0/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/m.0/m/m.0/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/model.6/m.0/m/m.0/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.6/m.0/m/m.0/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/model.6/m.0/m/m.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/m.0/m/m.0/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="model.6.m.0.m.1.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="1053048" size="36864" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.0.m.1.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/model.6/m.0/m/m.1/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Reshape_475" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1089912" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/model.6/m.0/m/m.1/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/m.0/m/m.1/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/model.6/m.0/m/m.1/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.6/m.0/m/m.1/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model.6.m.0.m.1.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="1090040" size="36864" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.0.m.1.cv2.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model.6/m.0/m/m.1/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Reshape_490" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1126904" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/model.6/m.0/m/m.1/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/m.0/m/m.1/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/model.6/m.0/m/m.1/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.6/m.0/m/m.1/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/model.6/m.0/m/m.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/m.0/m/m.1/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="model.6.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 64, 1, 1" offset="1127032" size="8192" />
			<output>
				<port id="0" precision="FP32" names="model.6.m.0.cv2.conv.weight">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/model.6/m.0/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_427" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1135224" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
